In [43]:
#Q1) 

import pandas as pd 

var = pd.Series([4,8,15,16,23,42])

var

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [44]:
# Q2) 

arr = [i*10 for i in range(1,11)]

var2 = pd.Series(arr)

print(var2)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [46]:
# Q3) 

arr = {'Name': ['Alice' , 'Bob' , 'Claire'] , 'Age' : [25,30,27] , 'gender' : ['Female' , 'Male' , 'Female']}
data = pd.DataFrame(arr)
print(data)

     Name  Age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4) 

Data Frame is like a matrix where no.of columns > 1 while series is a matrix whith noof columns = 1

# Q5) 

There are several functions used on Data Frame 

example : head() , tail() , iloc[] , info() , dropna() , etc...

Q6) 


Both Series , DataFrame are mutable data structures

In [53]:
# Q7)

data3 = {'series1' : var , 'series2' : var2}
pd.DataFrame(data3)

   series1  series2
0      0.0       10
1      8.0       20
2     15.0       30
3     16.0       40
4     23.0       50
5     42.0       60
6      NaN       70
7      NaN       80
8      NaN       90
9      NaN      100